Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/include/component/cvd.h
/*
 * Component description for CVD
 *
 * Copyright (c) 2023 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2023-04-11T16:47:11Z */
#ifndef _PIC32CXBZ31_CVD_COMPONENT_H_
#define _PIC32CXBZ31_CVD_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR CVD                                          */
/* ************************************************************************** */

/* -------- CVD_CVDCON : (CVD Offset: 0x00) (R/W 32) CVD Control Register -------- */
#define CVD_CVDCON_RESETVALUE                 _UINT32_(0x20000)                                    /*  (CVD_CVDCON) CVD Control Register  Reset Value */

#define CVD_CVDCON_TRIGSEL_Pos                _UINT32_(0)                                          /* (CVD_CVDCON) Selects one of 15 external trigger inputs to start scanning. Position */
#define CVD_CVDCON_TRIGSEL_Msk                (_UINT32_(0xF) << CVD_CVDCON_TRIGSEL_Pos)            /* (CVD_CVDCON) Selects one of 15 external trigger inputs to start scanning. Mask */
#define CVD_CVDCON_TRIGSEL(value)             (CVD_CVDCON_TRIGSEL_Msk & (_UINT32_(value) << CVD_CVDCON_TRIGSEL_Pos)) /* Assigment of value for TRIGSEL in the CVD_CVDCON register */
#define CVD_CVDCON_CLKSEL_Pos                 _UINT32_(4)                                          /* (CVD_CVDCON) Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3 Position */
#define CVD_CVDCON_CLKSEL_Msk                 (_UINT32_(0x3) << CVD_CVDCON_CLKSEL_Pos)             /* (CVD_CVDCON) Clock Select for FSM00= UPB_FSM_CLK01= External clock source 110= External clock source 211= External clock source 3 Mask */
#define CVD_CVDCON_CLKSEL(value)              (CVD_CVDCON_CLKSEL_Msk & (_UINT32_(value) << CVD_CVDCON_CLKSEL_Pos)) /* Assigment of value for CLKSEL in the CVD_CVDCON register */
#define CVD_CVDCON_FIFOTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDCON) Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion Position */
#define CVD_CVDCON_FIFOTH_Msk                 (_UINT32_(0x3FF) << CVD_CVDCON_FIFOTH_Pos)           /* (CVD_CVDCON) Threshold for the results FIFO that will cause an interrupt and watermark FIFOWM status bitassertion Mask */
#define CVD_CVDCON_FIFOTH(value)              (CVD_CVDCON_FIFOTH_Msk & (_UINT32_(value) << CVD_CVDCON_FIFOTH_Pos)) /* Assigment of value for FIFOTH in the CVD_CVDCON register */
#define CVD_CVDCON_FIFOTHIEN_Pos              _UINT32_(18)                                         /* (CVD_CVDCON) FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met Position */
#define CVD_CVDCON_FIFOTHIEN_Msk              (_UINT32_(0x1) << CVD_CVDCON_FIFOTHIEN_Pos)          /* (CVD_CVDCON) FIFO Threshold Interrupt Enable1= Controller will assert an interrupt when the FIFO threshold is met0= Controller will not assert an interrupt when the FIFO threshold is met Mask */
#define CVD_CVDCON_FIFOTHIEN(value)           (CVD_CVDCON_FIFOTHIEN_Msk & (_UINT32_(value) << CVD_CVDCON_FIFOTHIEN_Pos)) /* Assigment of value for FIFOTHIEN in the CVD_CVDCON register */
#define CVD_CVDCON_CVDIEN_Pos                 _UINT32_(19)                                         /* (CVD_CVDCON) Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts. Position */
#define CVD_CVDCON_CVDIEN_Msk                 (_UINT32_(0x1) << CVD_CVDCON_CVDIEN_Pos)             /* (CVD_CVDCON) Global Interrupt Enable for full macro. Gates any enabled FIFO or Scan Descriptor interrupts. Mask */
#define CVD_CVDCON_CVDIEN(value)              (CVD_CVDCON_CVDIEN_Msk & (_UINT32_(value) << CVD_CVDCON_CVDIEN_Pos)) /* Assigment of value for CVDIEN in the CVD_CVDCON register */
#define CVD_CVDCON_THSTR_Pos                  _UINT32_(23)                                         /* (CVD_CVDCON) Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO Position */
#define CVD_CVDCON_THSTR_Msk                  (_UINT32_(0x1) << CVD_CVDCON_THSTR_Pos)              /* (CVD_CVDCON) Threshold Store Mode1= Store only results which exceed the programmed threshold for the Scan Descriptor0= Store all results in FIFO Mask */
#define CVD_CVDCON_THSTR(value)               (CVD_CVDCON_THSTR_Msk & (_UINT32_(value) << CVD_CVDCON_THSTR_Pos)) /* Assigment of value for THSTR in the CVD_CVDCON register */
#define CVD_CVDCON_SWTRIG_Pos                 _UINT32_(24)                                         /* (CVD_CVDCON) Software Trigger control. Starts scan manuallyCleared by Hardware. Position */
#define CVD_CVDCON_SWTRIG_Msk                 (_UINT32_(0x1) << CVD_CVDCON_SWTRIG_Pos)             /* (CVD_CVDCON) Software Trigger control. Starts scan manuallyCleared by Hardware. Mask */
#define CVD_CVDCON_SWTRIG(value)              (CVD_CVDCON_SWTRIG_Msk & (_UINT32_(value) << CVD_CVDCON_SWTRIG_Pos)) /* Assigment of value for SWTRIG in the CVD_CVDCON register */
#define CVD_CVDCON_ABORT_Pos                  _UINT32_(25)                                         /* (CVD_CVDCON) Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware Position */
#define CVD_CVDCON_ABORT_Msk                  (_UINT32_(0x1) << CVD_CVDCON_ABORT_Pos)              /* (CVD_CVDCON) Instructs the controller to abort the current scan. The controller will move on to the next enabled ScanDescriptor if there is one, else it will go idle.Cleared by Hardware Mask */
#define CVD_CVDCON_ABORT(value)               (CVD_CVDCON_ABORT_Msk & (_UINT32_(value) << CVD_CVDCON_ABORT_Pos)) /* Assigment of value for ABORT in the CVD_CVDCON register */
#define CVD_CVDCON_SDWREN_Pos                 _UINT32_(27)                                         /* (CVD_CVDCON) Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain. Position */
#define CVD_CVDCON_SDWREN_Msk                 (_UINT32_(0x1) << CVD_CVDCON_SDWREN_Pos)             /* (CVD_CVDCON) Scan Descriptor Write Enable1= Enables writes to the scan descriptors, and prevents Scan Descriptor EN bits from being decoded and captured intoFSM_CLK domain by the Descriptor Selection Logic. This simplifies synchronization issues. The currently active ScanDescriptor registers should NOT be written even if SDWREN is asserted, as the FSM uses those bits directly without asynchronizer as a means of saving gates.0= Prevents writes to the scan descriptors, and enables the Descriptor Selector Logic to decode the next Scan Descriptor to run and capture it into the FSM domain. Mask */
#define CVD_CVDCON_SDWREN(value)              (CVD_CVDCON_SDWREN_Msk & (_UINT32_(value) << CVD_CVDCON_SDWREN_Pos)) /* Assigment of value for SDWREN in the CVD_CVDCON register */
#define CVD_CVDCON_ORDER_Pos                  _UINT32_(28)                                         /* (CVD_CVDCON) RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue Position */
#define CVD_CVDCON_ORDER_Msk                  (_UINT32_(0x1) << CVD_CVDCON_ORDER_Pos)              /* (CVD_CVDCON) RX/TX Loop Order1= Scan all requested TX indexes, then increment RX index and continue0= Scan all requested RX indexes, then increment TX index and continue Mask */
#define CVD_CVDCON_ORDER(value)               (CVD_CVDCON_ORDER_Msk & (_UINT32_(value) << CVD_CVDCON_ORDER_Pos)) /* Assigment of value for ORDER in the CVD_CVDCON register */
#define CVD_CVDCON_SIDL_Pos                   _UINT32_(29)                                         /* (CVD_CVDCON) Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode Position */
#define CVD_CVDCON_SIDL_Msk                   (_UINT32_(0x1) << CVD_CVDCON_SIDL_Pos)               /* (CVD_CVDCON) Stop in Idle Mode bit1= CVD controller halts when device enters Idle mode0= CVD controller continues running in Idle mode Mask */
#define CVD_CVDCON_SIDL(value)                (CVD_CVDCON_SIDL_Msk & (_UINT32_(value) << CVD_CVDCON_SIDL_Pos)) /* Assigment of value for SIDL in the CVD_CVDCON register */
#define CVD_CVDCON_FRZ_Pos                    _UINT32_(30)                                         /* (CVD_CVDCON) Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode Position */
#define CVD_CVDCON_FRZ_Msk                    (_UINT32_(0x1) << CVD_CVDCON_FRZ_Pos)                /* (CVD_CVDCON) Freeze Mode1= CVD controller halts in debugger mode0= CVD controller runs in debugger mode Mask */
#define CVD_CVDCON_FRZ(value)                 (CVD_CVDCON_FRZ_Msk & (_UINT32_(value) << CVD_CVDCON_FRZ_Pos)) /* Assigment of value for FRZ in the CVD_CVDCON register */
#define CVD_CVDCON_ON_Pos                     _UINT32_(31)                                         /* (CVD_CVDCON) Enables the State Machine to scan enabled Scan Descriptors upon next trigger. Position */
#define CVD_CVDCON_ON_Msk                     (_UINT32_(0x1) << CVD_CVDCON_ON_Pos)                 /* (CVD_CVDCON) Enables the State Machine to scan enabled Scan Descriptors upon next trigger. Mask */
#define CVD_CVDCON_ON(value)                  (CVD_CVDCON_ON_Msk & (_UINT32_(value) << CVD_CVDCON_ON_Pos)) /* Assigment of value for ON in the CVD_CVDCON register */
#define CVD_CVDCON_Msk                        _UINT32_(0xFB8FFF3F)                                 /* (CVD_CVDCON) Register Mask  */


/* -------- CVD_CVDADC : (CVD Offset: 0x04) (R/W 32) CVD ADC Configuration Register -------- */
#define CVD_CVDADC_RESETVALUE                 _UINT32_(0x00)                                       /*  (CVD_CVDADC) CVD ADC Configuration Register  Reset Value */

#define CVD_CVDADC_SELRES_Pos                 _UINT32_(0)                                          /* (CVD_CVDADC) Shared ADC Resolution bits Position */
#define CVD_CVDADC_SELRES_Msk                 (_UINT32_(0x3) << CVD_CVDADC_SELRES_Pos)             /* (CVD_CVDADC) Shared ADC Resolution bits Mask */
#define CVD_CVDADC_SELRES(value)              (CVD_CVDADC_SELRES_Msk & (_UINT32_(value) << CVD_CVDADC_SELRES_Pos)) /* Assigment of value for SELRES in the CVD_CVDADC register */
#define CVD_CVDADC_DIFFPEN_Pos                _UINT32_(2)                                          /* (CVD_CVDADC) Control differential mode operation of ANN0 Position */
#define CVD_CVDADC_DIFFPEN_Msk                (_UINT32_(0x1) << CVD_CVDADC_DIFFPEN_Pos)            /* (CVD_CVDADC) Control differential mode operation of ANN0 Mask */
#define CVD_CVDADC_DIFFPEN(value)             (CVD_CVDADC_DIFFPEN_Msk & (_UINT32_(value) << CVD_CVDADC_DIFFPEN_Pos)) /* Assigment of value for DIFFPEN in the CVD_CVDADC register */
#define CVD_CVDADC_DIGEN_Pos                  _UINT32_(3)                                          /* (CVD_CVDADC) Control differential mode operation of ANN0 Position */
#define CVD_CVDADC_DIGEN_Msk                  (_UINT32_(0x1) << CVD_CVDADC_DIGEN_Pos)              /* (CVD_CVDADC) Control differential mode operation of ANN0 Mask */
#define CVD_CVDADC_DIGEN(value)               (CVD_CVDADC_DIGEN_Msk & (_UINT32_(value) << CVD_CVDADC_DIGEN_Pos)) /* Assigment of value for DIGEN in the CVD_CVDADC register */
#define CVD_CVDADC_Msk                        _UINT32_(0x0000000F)                                 /* (CVD_CVDADC) Register Mask  */


/* -------- CVD_CVDSTAT : (CVD Offset: 0x08) (R/W 32) CVD Status Register -------- */
#define CVD_CVDSTAT_RESETVALUE                _UINT32_(0x20000000)                                 /*  (CVD_CVDSTAT) CVD Status Register  Reset Value */

#define CVD_CVDSTAT_SD1BUSY_Pos               _UINT32_(0)                                          /* (CVD_CVDSTAT) Scan Descriptor 1 is in progress Position */
#define CVD_CVDSTAT_SD1BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD1BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 1 is in progress Mask */
#define CVD_CVDSTAT_SD1BUSY(value)            (CVD_CVDSTAT_SD1BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD1BUSY_Pos)) /* Assigment of value for SD1BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD1DONE_Pos               _UINT32_(1)                                          /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1. Position */
#define CVD_CVDSTAT_SD1DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD1DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 1 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 1. Mask */
#define CVD_CVDSTAT_SD1DONE(value)            (CVD_CVDSTAT_SD1DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD1DONE_Pos)) /* Assigment of value for SD1DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD1INT_Pos                _UINT32_(2)                                          /* (CVD_CVDSTAT) Scan Descriptor 1 has caused an interrupt Position */
#define CVD_CVDSTAT_SD1INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD1INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 1 has caused an interrupt Mask */
#define CVD_CVDSTAT_SD1INT(value)             (CVD_CVDSTAT_SD1INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD1INT_Pos)) /* Assigment of value for SD1INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD2BUSY_Pos               _UINT32_(4)                                          /* (CVD_CVDSTAT) Scan Descriptor 2 is in progress Position */
#define CVD_CVDSTAT_SD2BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD2BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 2 is in progress Mask */
#define CVD_CVDSTAT_SD2BUSY(value)            (CVD_CVDSTAT_SD2BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD2BUSY_Pos)) /* Assigment of value for SD2BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD2DONE_Pos               _UINT32_(5)                                          /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2. Position */
#define CVD_CVDSTAT_SD2DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD2DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 2 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 2. Mask */
#define CVD_CVDSTAT_SD2DONE(value)            (CVD_CVDSTAT_SD2DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD2DONE_Pos)) /* Assigment of value for SD2DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD2INT_Pos                _UINT32_(6)                                          /* (CVD_CVDSTAT) Scan Descriptor 2 has caused an interrupt Position */
#define CVD_CVDSTAT_SD2INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD2INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 2 has caused an interrupt Mask */
#define CVD_CVDSTAT_SD2INT(value)             (CVD_CVDSTAT_SD2INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD2INT_Pos)) /* Assigment of value for SD2INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD3BUSY_Pos               _UINT32_(8)                                          /* (CVD_CVDSTAT) Scan Descriptor 3 is in progress Position */
#define CVD_CVDSTAT_SD3BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD3BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 3 is in progress Mask */
#define CVD_CVDSTAT_SD3BUSY(value)            (CVD_CVDSTAT_SD3BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD3BUSY_Pos)) /* Assigment of value for SD3BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD3DONE_Pos               _UINT32_(9)                                          /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3. Position */
#define CVD_CVDSTAT_SD3DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD3DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 3 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 3. Mask */
#define CVD_CVDSTAT_SD3DONE(value)            (CVD_CVDSTAT_SD3DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD3DONE_Pos)) /* Assigment of value for SD3DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD3INT_Pos                _UINT32_(10)                                         /* (CVD_CVDSTAT) Scan Descriptor 3 has caused an interrupt Position */
#define CVD_CVDSTAT_SD3INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD3INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 3 has caused an interrupt Mask */
#define CVD_CVDSTAT_SD3INT(value)             (CVD_CVDSTAT_SD3INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD3INT_Pos)) /* Assigment of value for SD3INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD4BUSY_Pos               _UINT32_(12)                                         /* (CVD_CVDSTAT) Scan Descriptor 4 is in progress Position */
#define CVD_CVDSTAT_SD4BUSY_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD4BUSY_Pos)           /* (CVD_CVDSTAT) Scan Descriptor 4 is in progress Mask */
#define CVD_CVDSTAT_SD4BUSY(value)            (CVD_CVDSTAT_SD4BUSY_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD4BUSY_Pos)) /* Assigment of value for SD4BUSY in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD4DONE_Pos               _UINT32_(13)                                         /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4. Position */
#define CVD_CVDSTAT_SD4DONE_Msk               (_UINT32_(0x1) << CVD_CVDSTAT_SD4DONE_Pos)           /* (CVD_CVDSTAT) Core will set this bit if Scan Descriptor 4 has completed at least once. Core will clear this bit uponreceiving next trigger for Scan Descriptor 4. Mask */
#define CVD_CVDSTAT_SD4DONE(value)            (CVD_CVDSTAT_SD4DONE_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD4DONE_Pos)) /* Assigment of value for SD4DONE in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_SD4INT_Pos                _UINT32_(14)                                         /* (CVD_CVDSTAT) Scan Descriptor 4 has caused an interrupt. Position */
#define CVD_CVDSTAT_SD4INT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_SD4INT_Pos)            /* (CVD_CVDSTAT) Scan Descriptor 4 has caused an interrupt. Mask */
#define CVD_CVDSTAT_SD4INT(value)             (CVD_CVDSTAT_SD4INT_Msk & (_UINT32_(value) << CVD_CVDSTAT_SD4INT_Pos)) /* Assigment of value for SD4INT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOCNT_Pos               _UINT32_(16)                                         /* (CVD_CVDSTAT) Results FIFO word count: Indicates the number of words in the Results FIFO. Position */
#define CVD_CVDSTAT_FIFOCNT_Msk               (_UINT32_(0x3FF) << CVD_CVDSTAT_FIFOCNT_Pos)         /* (CVD_CVDSTAT) Results FIFO word count: Indicates the number of words in the Results FIFO. Mask */
#define CVD_CVDSTAT_FIFOCNT(value)            (CVD_CVDSTAT_FIFOCNT_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOCNT_Pos)) /* Assigment of value for FIFOCNT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOMT_Pos                _UINT32_(29)                                         /* (CVD_CVDSTAT) The Results FIFO is empty. Position */
#define CVD_CVDSTAT_FIFOMT_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_FIFOMT_Pos)            /* (CVD_CVDSTAT) The Results FIFO is empty. Mask */
#define CVD_CVDSTAT_FIFOMT(value)             (CVD_CVDSTAT_FIFOMT_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOMT_Pos)) /* Assigment of value for FIFOMT in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOWM_Pos                _UINT32_(30)                                         /* (CVD_CVDSTAT) The Results FIFO has reached the programmed FIFOTHRESH threshold. Position */
#define CVD_CVDSTAT_FIFOWM_Msk                (_UINT32_(0x1) << CVD_CVDSTAT_FIFOWM_Pos)            /* (CVD_CVDSTAT) The Results FIFO has reached the programmed FIFOTHRESH threshold. Mask */
#define CVD_CVDSTAT_FIFOWM(value)             (CVD_CVDSTAT_FIFOWM_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOWM_Pos)) /* Assigment of value for FIFOWM in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_FIFOFULL_Pos              _UINT32_(31)                                         /* (CVD_CVDSTAT) The Results FIFO is full. Position */
#define CVD_CVDSTAT_FIFOFULL_Msk              (_UINT32_(0x1) << CVD_CVDSTAT_FIFOFULL_Pos)          /* (CVD_CVDSTAT) The Results FIFO is full. Mask */
#define CVD_CVDSTAT_FIFOFULL(value)           (CVD_CVDSTAT_FIFOFULL_Msk & (_UINT32_(value) << CVD_CVDSTAT_FIFOFULL_Pos)) /* Assigment of value for FIFOFULL in the CVD_CVDSTAT register */
#define CVD_CVDSTAT_Msk                       _UINT32_(0xE3FF7777)                                 /* (CVD_CVDSTAT) Register Mask  */


/* -------- CVD_CVDRESH : (CVD Offset: 0x10) ( R/ 32) CVD RESULTS POS FIFO Read Register (CVDRESH) -------- */
#define CVD_CVDRESH_RESETVALUE                _UINT32_(0x00)                                       /*  (CVD_CVDRESH) CVD RESULTS POS FIFO Read Register (CVDRESH)  Reset Value */

