Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/include/component/cvd.h
#define CVD_CVDSD1C1_SDOVRSAMP_Pos            _UINT32_(0)                                          /* (CVD_CVDSD1C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Position */
#define CVD_CVDSD1C1_SDOVRSAMP_Msk            (_UINT32_(0x7F) << CVD_CVDSD1C1_SDOVRSAMP_Pos)       /* (CVD_CVDSD1C1) Scan Descriptor Over Sampling0= One measurement1= Two measurements accumulated...127= 128 measurements accumulated Mask */
#define CVD_CVDSD1C1_SDOVRSAMP(value)         (CVD_CVDSD1C1_SDOVRSAMP_Msk & (_UINT32_(value) << CVD_CVDSD1C1_SDOVRSAMP_Pos)) /* Assigment of value for SDOVRSAMP in the CVD_CVDSD1C1 register */
#define CVD_CVDSD1C1_SDTH_Pos                 _UINT32_(8)                                          /* (CVD_CVDSD1C1) Scan Descriptor Threshold. Position */
#define CVD_CVDSD1C1_SDTH_Msk                 (_UINT32_(0xFFFFFF) << CVD_CVDSD1C1_SDTH_Pos)        /* (CVD_CVDSD1C1) Scan Descriptor Threshold. Mask */
#define CVD_CVDSD1C1_SDTH(value)              (CVD_CVDSD1C1_SDTH_Msk & (_UINT32_(value) << CVD_CVDSD1C1_SDTH_Pos)) /* Assigment of value for SDTH in the CVD_CVDSD1C1 register */
#define CVD_CVDSD1C1_Msk                      _UINT32_(0xFFFFFF7F)                                 /* (CVD_CVDSD1C1) Register Mask  */


/* -------- CVD_CVDSD1C2 : (CVD Offset: 0x114) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER -------- */
#define CVD_CVDSD1C2_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD1C2) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER  Reset Value */

#define CVD_CVDSD1C2_SDRXBEG_Pos              _UINT32_(0)                                          /* (CVD_CVDSD1C2) Scan Descriptor RX Index StartDetermines the first RX index to include in a scan. Position */
#define CVD_CVDSD1C2_SDRXBEG_Msk              (_UINT32_(0x3F) << CVD_CVDSD1C2_SDRXBEG_Pos)         /* (CVD_CVDSD1C2) Scan Descriptor RX Index StartDetermines the first RX index to include in a scan. Mask */
#define CVD_CVDSD1C2_SDRXBEG(value)           (CVD_CVDSD1C2_SDRXBEG_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDRXBEG_Pos)) /* Assigment of value for SDRXBEG in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDRXSTRIDE0_Pos          _UINT32_(6)                                          /* (CVD_CVDSD1C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Position */
#define CVD_CVDSD1C2_SDRXSTRIDE0_Msk          (_UINT32_(0x3) << CVD_CVDSD1C2_SDRXSTRIDE0_Pos)      /* (CVD_CVDSD1C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Mask */
#define CVD_CVDSD1C2_SDRXSTRIDE0(value)       (CVD_CVDSD1C2_SDRXSTRIDE0_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDRXSTRIDE0_Pos)) /* Assigment of value for SDRXSTRIDE0 in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDRXEND_Pos              _UINT32_(8)                                          /* (CVD_CVDSD1C2) Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete. Position */
#define CVD_CVDSD1C2_SDRXEND_Msk              (_UINT32_(0x3F) << CVD_CVDSD1C2_SDRXEND_Pos)         /* (CVD_CVDSD1C2) Scan Descriptor RX Index EndDetermines the last RX index to include in a scan.One the RX index pointer, which is incremented by the SDnRXSTRIDE+1 value, meets or exceeds this value, the RXloop of the scan is complete. Mask */
#define CVD_CVDSD1C2_SDRXEND(value)           (CVD_CVDSD1C2_SDRXEND_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDRXEND_Pos)) /* Assigment of value for SDRXEND in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDRXSTRIDE1_Pos          _UINT32_(14)                                         /* (CVD_CVDSD1C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Position */
#define CVD_CVDSD1C2_SDRXSTRIDE1_Msk          (_UINT32_(0x3) << CVD_CVDSD1C2_SDRXSTRIDE1_Pos)      /* (CVD_CVDSD1C2) Scan Descriptor RX Index StrideDetermines the number of RX Indexes included in a single measurement4'h0= One RX Index4'hF= 16 TX Indexes Mask */
#define CVD_CVDSD1C2_SDRXSTRIDE1(value)       (CVD_CVDSD1C2_SDRXSTRIDE1_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDRXSTRIDE1_Pos)) /* Assigment of value for SDRXSTRIDE1 in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDTXBEG_Pos              _UINT32_(16)                                         /* (CVD_CVDSD1C2) Scan Descriptor TX Index StartDetermines the first TX index to include in a scan. Position */
#define CVD_CVDSD1C2_SDTXBEG_Msk              (_UINT32_(0x3F) << CVD_CVDSD1C2_SDTXBEG_Pos)         /* (CVD_CVDSD1C2) Scan Descriptor TX Index StartDetermines the first TX index to include in a scan. Mask */
#define CVD_CVDSD1C2_SDTXBEG(value)           (CVD_CVDSD1C2_SDTXBEG_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDTXBEG_Pos)) /* Assigment of value for SDTXBEG in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDTXSTRIDE0_Pos          _UINT32_(22)                                         /* (CVD_CVDSD1C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Position */
#define CVD_CVDSD1C2_SDTXSTRIDE0_Msk          (_UINT32_(0x3) << CVD_CVDSD1C2_SDTXSTRIDE0_Pos)      /* (CVD_CVDSD1C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Mask */
#define CVD_CVDSD1C2_SDTXSTRIDE0(value)       (CVD_CVDSD1C2_SDTXSTRIDE0_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDTXSTRIDE0_Pos)) /* Assigment of value for SDTXSTRIDE0 in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDTXEND_Pos              _UINT32_(24)                                         /* (CVD_CVDSD1C2) Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete. Position */
#define CVD_CVDSD1C2_SDTXEND_Msk              (_UINT32_(0x3F) << CVD_CVDSD1C2_SDTXEND_Pos)         /* (CVD_CVDSD1C2) Scan Descriptor TX Index EndDetermines the last TX index to include in a scan.One the TX index pointer, which is incremented by the SDnTXSTRIDE+1 value, meets or exceeds this value, the TXloop of the scan is complete. Mask */
#define CVD_CVDSD1C2_SDTXEND(value)           (CVD_CVDSD1C2_SDTXEND_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDTXEND_Pos)) /* Assigment of value for SDTXEND in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_SDTXSTRIDE1_Pos          _UINT32_(30)                                         /* (CVD_CVDSD1C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Position */
#define CVD_CVDSD1C2_SDTXSTRIDE1_Msk          (_UINT32_(0x3) << CVD_CVDSD1C2_SDTXSTRIDE1_Pos)      /* (CVD_CVDSD1C2) Scan Descriptor TX Index StrideDetermines the number of TX Indexes included in a single measurement.4'h0= One TX Index4'bF= 16TX Indexes Mask */
#define CVD_CVDSD1C2_SDTXSTRIDE1(value)       (CVD_CVDSD1C2_SDTXSTRIDE1_Msk & (_UINT32_(value) << CVD_CVDSD1C2_SDTXSTRIDE1_Pos)) /* Assigment of value for SDTXSTRIDE1 in the CVD_CVDSD1C2 register */
#define CVD_CVDSD1C2_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (CVD_CVDSD1C2) Register Mask  */


/* -------- CVD_CVDSD1C3 : (CVD Offset: 0x118) (R/W 32) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER -------- */
#define CVD_CVDSD1C3_RESETVALUE               _UINT32_(0x00)                                       /*  (CVD_CVDSD1C3) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER  Reset Value */

#define CVD_CVDSD1C3_SDCHGTIME_Pos            _UINT32_(0)                                          /* (CVD_CVDSD1C3) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s) Position */
#define CVD_CVDSD1C3_SDCHGTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD1C3_SDCHGTIME_Pos)       /* (CVD_CVDSD1C3) Scan Descriptor Charge TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the CHARGE statedriving both the internal and external capacitor nodes, as well as the TX output(s) Mask */
#define CVD_CVDSD1C3_SDCHGTIME(value)         (CVD_CVDSD1C3_SDCHGTIME_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDCHGTIME_Pos)) /* Assigment of value for SDCHGTIME in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_SDACQTIME_Pos            _UINT32_(8)                                          /* (CVD_CVDSD1C3) Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle Position */
#define CVD_CVDSD1C3_SDACQTIME_Msk            (_UINT32_(0x7F) << CVD_CVDSD1C3_SDACQTIME_Pos)       /* (CVD_CVDSD1C3) Scan Descriptor Acquire TimeControls the number of cycles (clock based on CVDCON.CLKSEL[1:0]) the state machine waits in the ACQUIRE stateto allow the ADC voltage to settle Mask */
#define CVD_CVDSD1C3_SDACQTIME(value)         (CVD_CVDSD1C3_SDACQTIME_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDACQTIME_Pos)) /* Assigment of value for SDACQTIME in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_CVDCPL_Pos               _UINT32_(16)                                         /* (CVD_CVDSD1C3) Capacitor Voltage Divider (CVD) Setting bits Position */
#define CVD_CVDSD1C3_CVDCPL_Msk               (_UINT32_(0x7) << CVD_CVDSD1C3_CVDCPL_Pos)           /* (CVD_CVDSD1C3) Capacitor Voltage Divider (CVD) Setting bits Mask */
#define CVD_CVDSD1C3_CVDCPL(value)            (CVD_CVDSD1C3_CVDCPL_Msk & (_UINT32_(value) << CVD_CVDSD1C3_CVDCPL_Pos)) /* Assigment of value for CVDCPL in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_CVDEN_Pos                _UINT32_(19)                                         /* (CVD_CVDSD1C3)  Capacitive Voltage Division Enable bit Position */
#define CVD_CVDSD1C3_CVDEN_Msk                (_UINT32_(0x1) << CVD_CVDSD1C3_CVDEN_Pos)            /* (CVD_CVDSD1C3)  Capacitive Voltage Division Enable bit Mask */
#define CVD_CVDSD1C3_CVDEN(value)             (CVD_CVDSD1C3_CVDEN_Msk & (_UINT32_(value) << CVD_CVDSD1C3_CVDEN_Pos)) /* Assigment of value for CVDEN in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_SDMUT_Pos                _UINT32_(24)                                         /* (CVD_CVDSD1C3) Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements Position */
#define CVD_CVDSD1C3_SDMUT_Msk                (_UINT32_(0x1) << CVD_CVDSD1C3_SDMUT_Pos)            /* (CVD_CVDSD1C3) Scan Descriptor Mutual Mode1= Mutual Measurement Mode; TX outputs are part of CVD measurement and are driven0=No Mutual Measurement Mode; TX outputs are not part of CVD measurements Mask */
#define CVD_CVDSD1C3_SDMUT(value)             (CVD_CVDSD1C3_SDMUT_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDMUT_Pos)) /* Assigment of value for SDMUT in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_SDSELF_Pos               _UINT32_(25)                                         /* (CVD_CVDSD1C3) Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements Position */
#define CVD_CVDSD1C3_SDSELF_Msk               (_UINT32_(0x1) << CVD_CVDSD1C3_SDSELF_Pos)           /* (CVD_CVDSD1C3) Scan Descriptor Mutual Mode1= Self Measurement Mode; RX outputs are part of CVD measurement and are driven0= No Self Measurement; RX outputs are not part of CVD measurements Mask */
#define CVD_CVDSD1C3_SDSELF(value)            (CVD_CVDSD1C3_SDSELF_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDSELF_Pos)) /* Assigment of value for SDSELF in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_SDINTEN_Pos              _UINT32_(26)                                         /* (CVD_CVDSD1C3) Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt Position */
#define CVD_CVDSD1C3_SDINTEN_Msk              (_UINT32_(0x1) << CVD_CVDSD1C3_SDINTEN_Pos)          /* (CVD_CVDSD1C3) Scan Descriptor Interrupt Enable1= Scan Descriptor creates an interrupt if the accumulator threshold is met0= Scan descriptor does not create an interrupt Mask */
#define CVD_CVDSD1C3_SDINTEN(value)           (CVD_CVDSD1C3_SDINTEN_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDINTEN_Pos)) /* Assigment of value for SDINTEN in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_SDBUF_Pos                _UINT32_(27)                                         /* (CVD_CVDSD1C3) Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist) Position */
#define CVD_CVDSD1C3_SDBUF_Msk                (_UINT32_(0x1) << CVD_CVDSD1C3_SDBUF_Pos)            /* (CVD_CVDSD1C3) Scan Descriptor CVD Buffer Enable1= Use the SOC's CVD Buffer macro to drive the party-line (shared ADC core input) rather than the RX outputs0= SOC's CVD Buffer macro not used to drive party-line (or doesn't exist) Mask */
#define CVD_CVDSD1C3_SDBUF(value)             (CVD_CVDSD1C3_SDBUF_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDBUF_Pos)) /* Assigment of value for SDBUF in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_SDEN_Pos                 _UINT32_(30)                                         /* (CVD_CVDSD1C3) Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors. Position */
#define CVD_CVDSD1C3_SDEN_Msk                 (_UINT32_(0x3) << CVD_CVDSD1C3_SDEN_Pos)             /* (CVD_CVDSD1C3) Scan Descriptor Enable Mode00= Scan Descriptor Disabled01= Execute Scan Descriptor one time only, then clear the enable.10= Execute the Scan Descriptor, but keep enabled. Move on to next enabled descriptors.11= Execute the Scan Descriptor in a loop until a threshold match is detected, then clear the enable and move on tonext enabled descriptors. Mask */
#define CVD_CVDSD1C3_SDEN(value)              (CVD_CVDSD1C3_SDEN_Msk & (_UINT32_(value) << CVD_CVDSD1C3_SDEN_Pos)) /* Assigment of value for SDEN in the CVD_CVDSD1C3 register */
#define CVD_CVDSD1C3_Msk                      _UINT32_(0xCF0F7F7F)                                 /* (CVD_CVDSD1C3) Register Mask  */


