Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-BZ3_DFP/1.0.157/BZ3/include/component/cvd.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief CVD register API structure */
typedef struct
{  /* Hardware CVD Controller Macro */
  __IO  uint32_t                       CVD_CVDCON;         /**< Offset: 0x00 (R/W  32) CVD Control Register */
  __IO  uint32_t                       CVD_CVDADC;         /**< Offset: 0x04 (R/W  32) CVD ADC Configuration Register */
  __IO  uint32_t                       CVD_CVDSTAT;        /**< Offset: 0x08 (R/W  32) CVD Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       CVD_CVDRESH;        /**< Offset: 0x10 (R/   32) CVD RESULTS POS FIFO Read Register (CVDRESH) */
  __I   uint32_t                       CVD_CVDRESL;        /**< Offset: 0x14 (R/   32) CVD RESULTS NEG FIFO Read Register */
  __I   uint32_t                       CVD_CVDRESD;        /**< Offset: 0x18 (R/   32) CVD RESULTS DESCRIPTOR FIFO Read Register */
  __I   uint8_t                        Reserved2[0x64];
  __IO  uint32_t                       CVD_CVDRX[2];       /**< Offset: 0x80 (R/W  32) CVD RECEIVE INDEX N CONFIGURATION Register */
  __I   uint8_t                        Reserved3[0x38];
  __IO  uint32_t                       CVD_CVDTX[2];       /**< Offset: 0xC0 (R/W  32) CVD TRANSMIT INDEX NCONFIGURATION */
  __I   uint8_t                        Reserved4[0x38];
  __IO  uint32_t                       CVD_CVDSD0C1;       /**< Offset: 0x100 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER */
  __IO  uint32_t                       CVD_CVDSD0C2;       /**< Offset: 0x104 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD0C3;       /**< Offset: 0x108 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER */
  __IO  uint32_t                       CVD_CVDSD0T2;       /**< Offset: 0x10C (R/W  32) CVD SCAN DESCRIPTOR N TIME2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD1C1;       /**< Offset: 0x110 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER */
  __IO  uint32_t                       CVD_CVDSD1C2;       /**< Offset: 0x114 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD1C3;       /**< Offset: 0x118 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER */
  __IO  uint32_t                       CVD_CVDSD1T2;       /**< Offset: 0x11C (R/W  32) CVD SCAN DESCRIPTOR N TIME2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD2C1;       /**< Offset: 0x120 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER */
  __IO  uint32_t                       CVD_CVDSD2C2;       /**< Offset: 0x124 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD2C3;       /**< Offset: 0x128 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER */
  __IO  uint32_t                       CVD_CVDSD2T2;       /**< Offset: 0x12C (R/W  32) CVD SCAN DESCRIPTOR N TIME2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD3C1;       /**< Offset: 0x130 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL1 REGISTER */
  __IO  uint32_t                       CVD_CVDSD3C2;       /**< Offset: 0x134 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL2 REGISTER */
  __IO  uint32_t                       CVD_CVDSD3C3;       /**< Offset: 0x138 (R/W  32) CVD SCAN DESCRIPTOR N CONTROL3 REGISTER */
  __IO  uint32_t                       CVD_CVDSD3T2;       /**< Offset: 0x13C (R/W  32) CVD SCAN DESCRIPTOR N TIME2 REGISTER */
  __I   uint8_t                        Reserved5[0xC0];
  __IO  uint32_t                       CVD_CVDBG;          /**< Offset: 0x200 (R/W  32) CVD DEBUG REGISTER */
} cvd_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXBZ31_CVD_COMPONENT_H_ */
